/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isalnum.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: yshawn <yshawn@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/09/15 20:06:46 by yshawn            #+#    #+#             */
/*   Updated: 2020/03/07 00:50:13 by yshawn           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** The function checks for an alphanumeric character.
**
** Функция проверяет символ на принадлежность к текстовым символам.
*/

int				ft_isalnum(int c)
{
	return (ft_isalpha(c) || ft_isdigit(c) ? 1 : 0);
}
