/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isprint.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: yshawn <yshawn@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/09/15 20:07:23 by yshawn            #+#    #+#             */
/*   Updated: 2020/03/07 00:55:33 by yshawn           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** The function checks for any printable character including space.
**
** Функция проверяет, является ли символ печатаемым (включая пробел).
*/

int				ft_isprint(int c)
{
	return (c >= 32 && c <= 126 ? 1 : 0);
}
